mathis.likesyou.org/htdocs/app/Controllers/Troll.php

    public function confirmation()
    {
        $nom = $this->request->getPost('nom');
        $tentatives = (int) $this->request->getPost('tentatives_non');

        if (!empty($nom)) {
            $inviteModel = new \App\Models\InviteModel();

            $inviteModel->insert([
                'nom'            => $nom,
                'reponse'        => 'Oui',
                'tentatives_non' => $tentatives
            ]);
---
INSERT INTO `invites` (`nom`, `reponse`, `tentatives_non`, `created_at`, `updated_at`) VALUES ('Caca', 'Oui', 15, '2026-07-02 18:20:59', '2026-07-02 18:20:59')

    public function resultats()
    {
        // On réutilise notre fonction ici pour sécuriser la page des résultats
        if (!$this->estAdmin()) {
            $ipVisiteur = $this->request->getIPAddress();
            return $this->response->setStatusCode(403)
                                  ->setBody("<h1>Accès refusé</h1><p>Tu n'es pas l'administrateur. (Ton IP : $ipVisiteur)</p>");
        }

        $inviteModel = new \App\Models\InviteModel();

        $donnees['invites'] = $inviteModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `invites`
ORDER BY `created_at` DESC